Autodesk.Revit.DB.BendingDetailPositionOptions
An enumerated type listing the bending detail position options supported by the Bending Detail.

Autodesk.Revit.DB.BendingDetailPositionOptions.Bottom
The bending detail position is at the bottom of the Bending Detial.

Autodesk.Revit.DB.BendingDetailPositionOptions.Top
The bending detail position is at the top of the Bending Detial.

Autodesk.Revit.DB.BendingDetailPositionOptions.Left
The bending detail position is at the left of the Bending Detial.

Autodesk.Revit.DB.BendingDetailPositionOptions.Right
The bending detail position is at the right of the Bending Detial.